def delete():
    A = input('Введіть список елементів, розділених пробілами: ').split()
    print("Початковий список:", A)

    while True:
        # Запит на вибір дії
        choice = input("Введіть 1 для видалення елемента \nВведіть 2, щоб закінчити\nВведення: ")

        if choice == '1':
            element = input('Введіть елемент для видалення: ')
            if element in A:  # Перевірка на наявність елемента в списку
                A.remove(element)
                print("Оновлений список:", A)
            else:
                print("Елемент не знайдено у списку. Спробуйте ще раз.")

        elif choice == '2':
            print("Програма завершена.")
            break

        else:
            print("Незареєстрована дія. Спробуйте ще раз.")

    return A

delete()

